/*
 * screen.c
 *
 *  Created on: 2026年3月1日
 *      Author: 杨金乐
 */
#include "zf_common_headfile.h"

/*********************************************************************************************************************
*功能名称   使用tft180显示屏 显示
*引脚定义   SCL  P15_3
*引脚定义   SDA  P15_5
*引脚定义   RES  P15_1
*引脚定义   DC   P15_0
*引脚定义   CS   P15_2
*引脚定义   BL   P15_4
*   
*
*硬件参数  分辨率为128*160  字体大小选用8x6
*          
*
*      
*
*********************************************************************************************************************/

void screen_init(void)
{
    tft180_set_color(RGB565_RED, RGB565_WHITE); // 设置画笔颜色为红色，背景颜色为白色
    tft180_set_font(TFT180_6X8_FONT); // 设置字体大小为6x8
    tft180_init(); // 初始化屏幕
    tft180_clear(); // 清屏
}
